#半自动打拳机

print('by：吴帷,徐艺扬')

print('图中女性居多吗？')
print('a=女多于男或全为女性')
print('b=男多于女或全为男性')
选择1 = input('请输入：')
if 选择1 == 'a' :
    输出结果1 = '可怕，在这种情况都要女性来担当重任，男人们都死绝了？父系社会的本质就是在压榨和剥削女性。'
if 选择1 == 'b' :
    输出结果1 = '明明女性也同样在工作，为何只彰显男人的功绩、对女性的付出避而不谈？媒体使用春秋笔法，居心叵测。'

print('图中的女性好看吗？')
print('a=好看')
print('b=谈不上好看')
选择2 = input('请输入：')
if 选择2 == 'a' :
    输出结果2 = '物化女性的行径简直令人发指，女性不是男性的泄欲工具，而是独立的人。请不要用你们的眼神强奸别人。'
if 选择2 == 'b' :
    输出结果2 = '难道所有的女性都像图中那样不堪？用以偏概全的方式故意丑化女性，我只能感受到对女性的迫害和侮辱。'

print('是歌颂女性的吗？')
print('a=是')
print('b=不是')
选择3 = input('请输入：')
if 选择3 == 'a' :
    输出结果3 = '呵呵，中国女人承担了分内分外的所有事情，稍微歌功颂德就能打发了？目的还是为了更好的培养女人的奴性、让她们心甘情愿付出。'
if 选择3 == 'b' :
    输出结果3 = '中国女性明明承担了那么多，在这里连一点体现都没有？是我们不配吗？'

print(输出结果1,输出结果2,输出结果3,'地狱空荡荡，恶魔在人间。中国女性何时才能站起来？')

'''
print('')
print('a=')
print('b=')
选择* = input('请输入：')
if 选择* == a :
    输出结果* = ''
if 选择* == b :
    输出结果* = ''
'''
